app/views/tasks/create.js.erb

INSERT INTO "tasks" ("created_at", "updated_at", "title", "deadline", "category_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", "2019-11-20 13:22:07.870826"], ["updated_at", "2019-11-20 13:22:07.870826"], ["title", "a"], ["deadline", "2019-01-01 00:00:00"], ["category_id", 2]]
---
document.getElementById("<%= @category.title%>").insertAdjacentHTML("beforeend", "<%= j render 'task', task: @task %>");