app/controllers/emails_controller.rb

INSERT INTO "emails" ("object", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"
---
      def create
        @email = Email.new(object: Faker::Book.title, body: Faker::ChuckNorris.fact)
        if @email.save

SELECT  "emails".* FROM "emails" WHERE "emails"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
UPDATE "emails" SET "read" = $1, "updated_at" = $2 WHERE "emails"."id" = $3  [["read", false], ["updated_at", "2019-11-21 17:41:31.373325"], ["id", 10]]
UPDATE "emails" SET "read" = $1, "updated_at" = $2 WHERE "emails"."id" = $3  [["read", true], ["updated_at", "2019-11-21 17:41:27.652304"], ["id", 10]]
---
      def update
        @email = Email.find(params[:id])
        if @email.read == true
        @email.update_attribute(:read, false)
        respond_to do |format|
            format.html {redirect_to emails_path}
            format.js { }
          end
        else
          @email.update_attribute(:read, true)