app/views/emails/create.js.erb

console.log('<%= a = ((@email.id).to_i - 1) %>')
document.getElementsByTagName("tbody")[0].insertAdjacentHTML("beforeend", "<%= j render 'email', mail: @email %>");
---
INSERT INTO "emails" ("object", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["object", "Sleep the Brave"], ["body", "Chuck Norris burst the dot com bubble."], ["created_at", "2019-11-21 11:09:30.417065"], ["updated_at", "2019-11-21 11:09:30.417065"]]